---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementManyLoops
source: html/9a91e5fe-6a53-05b5-4ac2-94e139b72dc6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementManyLoops Property

Sketch contains more than one chain. Can't create Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathReinforcementManyLoops { get; }
```